CREATE DATABASE  IF NOT EXISTS `qunawan` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `qunawan`;
-- MySQL dump 10.13  Distrib 5.6.13, for Win32 (x86)
--
-- Host: localhost    Database: qunawan
-- ------------------------------------------------------
-- Server version	5.5.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `trip`
--

DROP TABLE IF EXISTS `trip`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `trip` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `num` int(10) NOT NULL,
  `title` varchar(100) NOT NULL,
  `s_title` varchar(10) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `start_place` int(11) NOT NULL,
  `position` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `traffic` varchar(20) DEFAULT NULL,
  `hotel` varchar(20) DEFAULT NULL,
  `time` int(5) DEFAULT NULL,
  `good_rate` float(5,1) DEFAULT NULL,
  `place_score` float(5,1) DEFAULT NULL,
  `hotel_score` float(5,1) DEFAULT NULL,
  `service_score` float(5,1) DEFAULT NULL,
  `traffic_score` float(5,1) DEFAULT NULL,
  `is_ok` bit(1) DEFAULT b'0',
  PRIMARY KEY (`id`),
  KEY `start_place` (`start_place`),
  KEY `position` (`position`),
  KEY `FK_trip_seq` (`type`),
  KEY `FK27E845956B9D06` (`start_place`),
  KEY `FK27E8452E52C683` (`position`),
  KEY `FK27E84525D49B2C` (`type`),
  CONSTRAINT `FK27E84525D49B2C` FOREIGN KEY (`type`) REFERENCES `sequence` (`id`),
  CONSTRAINT `FK27E8452E52C683` FOREIGN KEY (`position`) REFERENCES `position` (`id`),
  CONSTRAINT `FK27E845956B9D06` FOREIGN KEY (`start_place`) REFERENCES `city` (`id`),
  CONSTRAINT `FK_trip_seq` FOREIGN KEY (`type`) REFERENCES `sequence` (`id`),
  CONSTRAINT `trip_ibfk_1` FOREIGN KEY (`start_place`) REFERENCES `city` (`id`),
  CONSTRAINT `trip_ibfk_2` FOREIGN KEY (`position`) REFERENCES `position` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `trip`
--

LOCK TABLES `trip` WRITE;
/*!40000 ALTER TABLE `trip` DISABLE KEYS */;
INSERT INTO `trip` VALUES (1,20151104,'嘉兴原生态温泉门票２张＋四星景文华都酒店，自由行特卖·双人只需２９９！赶紧抢购吧！&','嘉兴原生态温泉',1,1,3,'自驾','景文华都酒店',5,100.0,5.0,5.0,5.0,5.0,''),(2,20151028,'【上海松江1天1夜】住上海旗山大酒店1晚，免费游佘山森林公园','上海一日游',1,2,1,'大巴','自行解决',4,100.0,5.0,5.0,5.0,5.0,''),(3,20151029,'【享受住宿温泉“零”距离，上海2天1晚】住上海之根雪浪湖度假','杭州西湖',1,3,2,'火车+大巴','汉庭',3,100.0,4.8,5.0,4.8,5.0,''),(4,20151030,'【异域风情，雪浪湖温泉2日1晚】住1晚维也纳酒店(嘉兴店）','嘉兴原生态温泉',1,1,3,'自驾','景文华都酒店',2,100.0,5.0,5.0,5.0,5.0,''),(5,20151101,'【杭州2天1晚】泡云曼温泉（热带雨林氡温泉）＋游湘湖＋观湘湖水景秀＋住4星萧山宝盛宾馆＋中西式自助双早&','杭州云曼温泉',543,13,1,'自驾','萧山宝盛宾馆',1,80.0,4.2,4.2,4.2,4.2,''),(6,20151102,'千岛湖2天1夜单人套餐.自由行特卖】住龙庭开元大酒店，游千岛湖中心湖（含游船票）&','千岛湖中心游',1,3,2,'飞机+大巴','龙庭开元大酒店',1,100.0,5.0,5.0,5.0,5.0,''),(7,20151103,'【杭州建德199元／人·跟队自驾特卖】建德森林温泉度假酒店1晚(含早)＋新安江玉温泉＋酒店晚餐(2荤2素)&','建德森林温泉度假',1,1,3,'大巴+飞机+轮船','建德森林温泉度假酒店',1,100.0,5.0,5.0,5.0,5.0,''),(8,20151104,'【千岛湖住1晚】秀水舫酒店(漂浮水上) ＋ 景区5选1 ＋ 早餐&','千岛湖秀水舫',543,12,1,'自驾','秀水舫酒店',1,100.0,5.0,5.0,5.0,5.0,''),(9,20151105,'游宋城（跑男拍摄地）＋观千古情演出＋住杭州千古情主题酒店（民族风情酒店）＋自助早、免费停车&','宋城千古情',1,3,2,'火车+大巴','杭州千古情主题酒店',1,100.0,5.0,5.0,5.0,5.0,''),(10,20151106,'【激情燃烧，欢乐谷2天1晚】住1晚上海松江世茂睿选酒店，嗨翻','欢乐谷',1,1,3,'火车+大巴','无',1,100.0,5.0,5.0,4.8,4.8,''),(11,20140190,'【杭州2天1晚】泡云曼温泉（热带雨林氡温泉）＋游湘湖＋观湘湖水景秀＋住4星萧山宝盛宾馆＋中西式自助双早','杭州云曼温泉',1,2,1,'自驾','萧山宝盛宾馆',1,100.0,5.0,5.0,5.0,5.0,''),(12,20131209,'千岛湖2天1夜单人套餐.自由行特卖】住龙庭开元大酒店，游千岛湖中心湖（含游船票）','千岛湖中心游',1,3,2,'轮船+大巴','龙庭开元大酒店',1,100.0,5.0,4.8,4.8,4.8,''),(13,20110901,'【杭州建德199元／人·跟队自驾特卖】建德森林温泉度假酒店1晚(含早)＋新安江玉温泉＋酒店晚餐(2荤2素)','建德森林温泉度假',1,1,3,'自驾','建德森林温泉度假酒店',1,100.0,5.0,5.0,4.8,5.0,''),(14,20090101,'【如果·你也在西塘】畅游千年古镇西塘，入住古镇景区内西塘C部落主题客栈2人1晚双人行，送西塘联票2张，骚红小本田西塘接站','西塘古镇',1,2,1,'火车+飞机','西塘C部落主题客栈',1,100.0,5.0,5.0,5.0,5.0,''),(15,20080421,'【游西塘，住宿现代型客栈】游西塘古镇，体验不一样的的风景，住缘来于你客栈2天1晚（送西塘门票2张、特色早餐2份）还可以免费垂钓哦！','畅游西塘',1,3,2,'火车','缘来于你客栈',1,100.0,5.0,4.7,4.7,5.0,''),(16,20100421,'【千岛湖住1晚】秀水舫酒店(漂浮水上) ＋ 景区5选1 ＋ 早餐','千岛湖秀水舫',1,1,3,'自驾','秀水舫酒店',1,100.0,5.0,5.0,5.0,5.0,''),(17,20150921,'【舟山普陀山住1晚自驾游】住普陀山锦屏山庄／瑞景大酒店1晚／天竺山庄（随机安排），游普陀山景区','舟山普陀游',1,2,1,'轮船+火车','普陀山锦屏山庄／瑞景大酒店1晚／天竺山庄',1,100.0,4.8,5.0,4.8,5.0,''),(18,20140821,'【阳光水岸度假村湖景房】千岛湖森林氧吧纯玩巴士2日游（可选行程：千岛湖中心湖或骑行或千岛湖水之灵表演） ','千岛湖森林氧吧',1,3,2,'大巴+轮船+火车','千岛湖秀水度假酒店',1,100.0,4.7,4.7,4.7,4.7,''),(19,20130912,'桐庐垂云通天河、千岛湖桂花岛巴士2日游','通天河&桂花岛',1,1,3,'大巴','桐庐标准间',1,100.0,5.0,5.0,5.0,5.0,''),(20,20140102,'【豪华酒店·渔村古城2天1晚】住石浦半岛酒店，游中国渔村，逛渔港古城，赏象山影视城，超值奢华享受 ','石浦逛渔港',1,2,1,'大巴+火车','石浦半岛酒店',1,100.0,5.0,5.0,5.0,5.0,''),(21,20150909,'【天天发班】普陀山、佛顶山、奉化溪口、雪窦山巴士5日游（宁波参团，宿1晚普陀农家3晚宁波酒店）','普佛奉雪天天游',1,3,2,'大巴+火车','宿1晚普陀农家3晚宁波酒店',1,100.0,5.0,5.0,5.0,5.0,''),(22,20090911,'游宋城（跑男拍摄地）＋观千古情演出＋住杭州千古情主题酒店（民族风情酒店）＋自助早、免费停车','宋城千古情',1,1,3,'飞机+火车','杭州千古情主题酒店',1,100.0,5.0,5.0,5.0,4.8,''),(23,20010901,'上海欢乐谷4','欢乐谷',1,2,1,'大巴','无',1,100.0,5.0,5.0,5.0,5.0,''),(24,20140001,'上海野生动物园','上海野生动物园',1,3,2,'轮船','无',1,100.0,5.0,5.0,5.0,5.0,''),(25,20150915,'杭州大明山景区','杭州大明山',1,1,3,'大巴+轮船','无',1,100.0,5.0,5.0,5.0,5.0,''),(26,20151125,'【高性价比】桂林、阳朔双飞4日自由行（2晚桂林5星帝苑酒店、1晚阳朔君豪，尽享舒适的住宿）','桂林、阳朔双飞4日行',470,1,2,'飞机+大巴','桂林帝苑酒店',4,100.0,5.0,5.0,5.0,5.0,''),(27,20151126,'【杭州临安·东南亚风情湍口温泉无限享】住1晚湍口众安氡温泉度假酒店＋双人自助早，免费观影，送浙西三峡景区门票【温泉特卖】','杭州临安·东南亚风情',470,1,1,'自驾','临安湍口众安氡温泉度假酒店',2,100.0,5.0,5.0,5.0,5.0,''),(28,20151127,'【金凤凰温泉2天1晚双人2日游·自由行】泡金凤凰温泉，住金凤凰温泉特色桃花汤屋【温泉特卖】','金凤凰温泉',1,1,2,'飞机+火车+大巴','金凤凰温泉度假村特色桃花屋',2,100.0,5.0,5.0,5.0,5.0,''),(29,20151128,'【冬季避寒·感恩节】游西双版纳、勐仑、景洪入住奢华安娜塔拉、洲际酒店、喜来登、望天树热带雨林6日游','热带雨林六日游',522,1,2,'飞机+大巴','西双版纳安娜塔拉国际度假酒店',6,100.0,4.7,5.0,5.0,5.0,''),(30,20151129,'上海-厦门双飞4日自由行（世纪寰岛酒店 赠接机服务）','上海-厦门双飞',470,1,2,'飞机','厦门世纪寰岛酒店',4,100.0,5.0,5.0,5.0,5.0,''),(31,20151130,'成都、九寨沟、牟尼沟纯玩美食养生6日游（入住2晚九寨沟天源豪生大酒店，3晚成都上层名人大酒店','美食养生纯玩6日',1,1,2,'飞机+火车+大巴','九寨沟天源豪生大酒店',6,100.0,5.0,5.0,5.0,5.0,''),(32,20151131,'三亚蜈支洲岛、天涯海角、亚龙湾天堂森林公园5日游（3晚三亚湾红树林、1晚海棠湾喜来登，体验海南地道美食）','三亚五日游',210,1,2,'大巴','三亚湾红树林度假酒店',5,100.0,5.0,5.0,4.0,5.0,''),(33,20151132,'【冰天雪地——0购物0自费】哈尔滨雪乡穿越、长白山、魔界、雾凇岛、打雪仗、堆雪人 赏正宗东北二人转7日大环线','哈尔滨雪之七日游',247,1,1,'大巴+自驾','哈尔滨三星标准酒店双标间',7,100.0,5.0,5.0,5.0,5.0,''),(34,20151133,'年末大促已减600每人”韩国首尔3晚4日自由行 (韩亚航空天天出发 五花特二酒店 含接机)★★★★★【年末大促特卖】','韩国首尔',470,1,3,'飞机+轮船','华美达安可酒店',4,100.0,4.8,5.0,5.0,4.8,''),(35,20151134,'塞班岛5晚6日半自助游(已含税 上海直飞 入住海景酒店或黄金海滩酒店或王子酒店或同级酒店 含环岛游','塞班岛半自助',470,1,3,'飞机+轮船','塞班海景酒店',6,100.0,5.0,4.8,5.0,5.0,''),(36,20151135,'西班牙、葡萄牙12日游(品质酒店 精品购物村 葡萄牙当地风味餐 赠送65欧弗朗门戈舞表演 )','西班牙异地风气',470,1,3,'飞机','HOTEL NUEVO MADRID',12,100.0,5.0,5.0,5.0,5.0,''),(37,20151136,'意大利一地8日游 （阿提哈德航空公司 游览罗马 佛罗伦萨 威尼斯 米兰 特别赠送THE MALL）','意大利8日游',470,1,3,'飞机+大巴','Hotel Da Vinci',8,100.0,5.0,5.0,5.0,5.0,''),(38,20151137,'巴厘岛雨林瑞士贝尔4晚6日（赠送机场酒店往返接送机）','情系巴厘岛',470,1,3,'飞机+轮船','Aston Denpasar',6,100.0,5.0,5.0,5.0,5.0,''),(39,20151138,'南非全“心”5晚8日游 ( 非洲百兽宴、特色茅草屋、比林斯堡国家动物保护区、桌山）','野性南非',470,1,3,'飞机+大巴','INDABA HOTEL',8,100.0,5.0,5.0,5.0,5.0,''),(40,20151139,'希腊一地6晚9日游(一价全包 雅典卫城（含讲解） OIA小镇 浪漫圣托里尼岛 科林斯运河、埃匹达鲁斯古剧场、纳普良小城)','希腊浪漫之旅',470,1,3,'飞机','Blue Suites Hotel',9,100.0,5.0,5.0,5.0,4.5,'');
/*!40000 ALTER TABLE `trip` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-08-31 23:21:50
